org/windows_cached_credentials_as_system.org
:PROPERTIES:
:ID:       177e533f-3d99-4769-b897-cc64d87647cb
:END:
#+title: Windows - Cached Credentials as SYSTEM
#+hugo_base_dir:../


* Credentials cached as SYSTEM
Cached Passwords - SYSTEM

There are passwords that can be stored in the SYSTEM context that can't be seen in the normal Credential Manager view.

Download ~PsExec.exe~ from Technet and copy it to ~C:\Windows\System32~.

From a command prompt run:    src_sh{psexec -i -s -d cmd.exe}.

From the new DOS window run:  src_sh{rundll32 keymgr.dll,KRShowKeyMgr}

Remove any items that appear in the list of Stored User Names and Passwords.  Restart the computer.
